<p>
Ещё одна проблема — интеграция в проприетарную систему универсальных сторонних решений. Например, PHP-классов. Собственно, по той же самой причине. В результате стоимость не только разработки web-сайта, но и его поддержки в случае выбора проприетарной CMS может на порядок «превзойти» ваши ожидания. </p>
<p>
И, как было замечено выше, если ранее качество платных/бесплатных CMS, действительно, заметно отличалось, сейчас это отличие под вопросом. </p>
<p>
Более подробно проблема выбора подходящей CMS рассмотрена в <a href="index.php?option=com_content&view=">специальном разделе</a>. Обратите внимание, что, воспользовавшись нашим конструктором сайтов, вы можете бесплатно экспериментировать с различными наборами опций и систем, чтобы, в конце концов, принять лучшее решение. Ниже вы можете ознакомиться со схемой критериев выбора CMS.</p>
