<p>
Возникает вопрос — зачем же заказчики вообще ищут программистов на фрилансе? </p>
<p>
В большинстве случаев это происходит тогда, когда нужно выполнить относительно небольшую задачу — не нанимать же веб-студию для разработки, например, одного компонента для CMS! </p>
<p>
Так обычно и рассуждали/рассуждают до сих пор некоторые заказчики. И нанимают фрилансера. Иногда успешно. Иногда —  см. <a href="#wrong_developer">выше</a>. Веб-студии рассуждают так же. Мы, однако, считаем данный подход устаревшим. Мы выполняем для своих клиентов и такие работы, потому что можем позволить себе и такое. Узнайте, почему это выгодно не только для вас, но и для нас тоже.</p>
