<p>
Free-lance.ru, мягко выражаясь, сомнительный сервис. Любой фрилансер может «тупо» купить себе статус “pro”. Почти как индульгенцию. Т.е., реальные навыки исполнителя владельцев сервиса, похоже, не волнуют, главное, чтоб деньги платили. Никаких систем тестирования на сайте нет, так что, судить достоверно о квалификации разработчика очень сложно. Разве что, по отзывам заказчиков, но и этот показатель не слишком надежен, потому что:</p>
<ol>
  <li>
    Не факт, что исполнитель, успешно решив несколько несложных задач, не подведёт вас там, где требуются серьёзные навыки.</li>
  <li>
    С недавних пор на free-lance.ru вообще нельзя оставлять отрицательные отзывы об исполнителях, если сделка не была оформлена через их сервис (!). Т.е., исполнитель может взять заказ, потом подвести заказчика, но если заказ не был закрыт, то заказчик попросту не сможет оставить отрицательный отзыв и «досье» исполнителя останется чистым.</li>
  <li>
    Некоторые фрилансеры регистрировались и в качестве заказчиков, после чего сами себе оставляли положительные отзывы.</li>
  <li>
    На free-lance.ru (и других подобных сайтах) широко практикуется «взаимовыгодный обмен отзывами» между заказчиками и исполнителями, т.е., это делается не в качестве реальной оценки квалификации разработчика, а потому что это выгодно обеим сторонам.</li>
</ol>
<p>
  В общем, дело довольно тёмное. </p>
<p>
Хотим заметить, что для Рунета этот подход является «нормальным», чего не скажешь о «настоящих» free-lance сайтах, таких, как odesk.com, например, где исполнители могут пройти массу тестов на профпригодность. Недостатком подобных free-lance marketplaces является то, что стороны могут общаться только на англ. языке (иное не допускается их правилами). </p>
