<p>
Это не так просто, как может показаться на первый взгляд. Как правило, когда говорят о готовых решениях, прежде всего, имеют в виду CMS. Однако они, в свою очередь, могут включать в себя ряд дополнительных конструкций (расширений), таких, как:</p>
<ul>
  <li>
    Компоненты</li>
  <li> Модули</li>
  <li> Шаблоны</li>
  <li> Плагины</li>
  <li> Виджеты</li>
</ul>
<p>
  …и т.п.</p>
<p>
Их выбор и совместимость зависят от многих факторов, в первую очередь, таких, как популярность системы и тип (бесплатная/платная). Бытует мнение, что платные CMS лучше, но это совсем не факт! В действительности, различие не в качестве, а в том, кто и на каких условиях будет оказывать вам поддержку. Разработчики бесплатных CMS не несут перед вами никаких обязательств, тогда как разработчики проприетарных формально должны отвечать на ваши вопросы, консультировать вас и т.п. В реальности, однако, всё не так однозначно, потому что то, что будут делать для вас разработчики платной CMS, указано в лицензионном соглашении, т.о., вам, как минимум, необходимо его тщательнейшим образом изучить. Чего точно они не будут для вас делать бесплатно — так это создавать требуемые вам компоненты, не входящие в исходную комплектацию. В лучшем случае вы сможете купить у них какой-либо дополнительный модуль за дополнительные же деньги, но не факт, что он полностью удовлетворит вашим потребностям. Значит, вам придётся опять же нанимать стороннего программиста, чтобы он доработал его до нужного состояния. А вот тут-то вас подстерегает масса подводных камней.</p>
