<p>
Многие владельцы сайтов принимают необоснованные решения при выборе платформы и/или разработчика, потому что не совсем ясно видят концепцию своего ресурса. Однако иногда это, действительно, достаточно сложно, потому что web — чрезвычайно динамичная среда. Поэтому вторым критически важным фактором является выбор максимально гибкой архитектуры вашего приложения. Мы уделяем этому аспекту самое пристальное внимание. Современное веб-приложение должно быть таким, чтобы:</p>
<ol>
  <li>
    Любой функционал можно было бы добавить в максимально сжатый срок.</li>
  <li> Любой модуль, компонент, плагин, виджет и т.п., можно было бы легко как инсталлировать, так и удалить из системы, не засоряя её исходники «мёртвым» кодом</li>
  <li> Любой компонент должен быть написан в соответствии с принятыми стандартами ООП и любому разработчику с первого взгляда должно быть понятно, «как это работает».</li>
  <li> Различные аспекты вашего сайта — дизайн, функционал, юзабилити — должны быть связаны друг с другом концептуально, но не физически. Т.е., смена дизайна, например, не должна вызывать каких-либо дополнительных работ, связанных с программированием и т.п.</li>
  <li> Архитектура приложения должна позволять легко не только добавлять компоненты сторонних разработчиков, но и модифицировать их в рамках выбранной вами концепции.</li>
  <li> Поддержка системы должна быть по силам обычному пользователю, не обременённому глубокими знаниями программирования.</li>
</ol>
