<p>
Пожалуй, только поговорив с ним и, если получится, дав выполнить тестовое задание. Однако составить таковое, чтобы оно было полезным и более-менее достоверно определяло профессиональный уровень разработчика — целая головная боль. Мы долго думали над этим вопросом и, в конце концов, добавили возможность для наших клиентов протестировать потенциального разработчика. Работает это очень просто:</p>
<ol>
  <li>
    Если у вас на примете есть кандидат, получите от него согласие на прохождение теста. Вряд ли ответственный специалист откажется от возможности лишний раз доказать свой профессионализм.</li>
  <li> Зарегистрируйтесь на нашем сайте.</li>
  <li> Узнайте у своего потенциального разработчика емэйл, который он должен будет указать при прохождении теста.</li>
  <li> Укажите емэйл кандидата в своём аккаунте, чтобы мы знали, что результаты его тестирования нужно отправлять именно вам.</li>
  <li> Дайте ему ссылку на страницу тестирования.</li>
</ol>
<p>
  После того, как тест будет пройден, вы получите результат по емэйлу и сможете решить — стоит ли сотрудничать с данным человеком.</p>
<p>
Тест включает в себя ответы на вопросы по основным технологиям, используемым в веб-строительстве плюс знание англ. языка и (неявно) тест на адекватность. Обратите внимание, что потенциальный разработчик не обязан проходить все тесты — это уж как он решит и/или как вы с ним договоритесь.</p>
<p>
Разумеется, что вы полностью освобождаетесь от подобных проблем в случае, если заказываете разработку веб-сайта у нас.</p>
