<a name="wrong_developer"></a><p>
Если вы нашли его на фрилансе, то, боимся, выйти из этой ситуации без потерь вам будет нелегко. Если вы не делали предоплату, то, возможно, вы потеряете только время, что само по себе тоже неприятно, но лучше, чем потерять и время, и деньги. Помните, что фриланс-сайты не несут ответственности за качество выполнения работ. Даже, когда сами подбирают вам исполнителя (а это стоит несколько тысяч). В последнем случае они попросту делают рассылку среди фрилансеров, никак не выясняя реальную квалификацию кандидатов. Да-да, мы даже проводили специальное исследование на эту тему и задавали вопрос — а что будет, если мы заплатим вам эти несколько тысяч, вы найдёте исполнителя, а через некоторое время он не справится с заданием или попросту исчезнет? Вернёте ли вы нам деньги?</p>
<p>
Угадайте с одного раза, какой ответ мы получили.</p>
<p>
Однако всё это — цветочки. Настоящие проблемы начинаются не в процессе сотрудничества с фрилансером, а спустя некоторое (иногда довольно значительное) время, когда ВНЕЗАПНО выясняется, что сайт написан «криво» и «сам чёрт там ногу сломит». Ну, а того, кто «это» написал, уже и след простыл, естественно. Бесплатная поддержка и доработка…? Забудьте об этом.</p>
<p>
Знакомая ситуация? Понимаем и скорбим вместе с вами.</p>
